tests/stubs/stripeConnectCheckoutSessionAsyncPaymentFailed.json

{
  "id": "evt_1HyL3eEtj5TOOzkmYm5d7nkt",
  "object": "event",
  "account": "acct_1HYaDIEtj5TOOzkm",
  "api_version": "2020-03-02",
  "created": 1607967722,
  "data": {
    "object": {
      "id": "cs_test_a1QLYEceQdw3E1gEC1T3QEn5PSdfufzDjs4DoXpxHuDl7XTMttyKTBJsfQ",
      "object": "checkout.session",
      "allow_promotion_codes": null,
      "amount_subtotal": 100000,
      "amount_total": 100000,
      "billing_address_collection": null,
      "cancel_url": "http://pub.posit-app.localhost/posit/d35b6abe-5827-4a65-bf03-962a1f96ba16",
      "client_reference_id": "d35b6abe-5827-4a65-bf03-962a1f96ba16",
      "currency": "gbp",
      "customer": "cus_IZU1XssoEV51yZ",
      "customer_email": null,
      "livemode": false,
      "locale": null,
      "metadata": {
      },
      "mode": "payment",
      "payment_intent": "pi_1HyL1IEtj5TOOzkmCsW2fiA8",
      "payment_method_types": [
        "card",
        "bacs_debit"
      ],
      "payment_status": "unpaid",
      "setup_intent": null,
      "shipping": null,
      "shipping_address_collection": null,
      "submit_type": null,
      "subscription": null,
      "success_url": "http://pub.posit-app.localhost/posit/d35b6abe-5827-4a65-bf03-962a1f96ba16",
      "total_details": {
        "amount_discount": 0,
        "amount_tax": 0
      },
      "display_items": [
        {
          "amount": 100000,
          "currency": "gbp",
          "custom": {
            "description": null,
            "images": null,
            "name": "d35b6abe-5827-4a65-bf03-962a1f96ba16"
          },
          "quantity": 1,
          "type": "custom"
        }
      ]
    }
  },
  "livemode": false,
  "pending_webhooks": 3,
  "request": {
    "id": null,
    "idempotency_key": null
  },
  "type": "checkout.session.async_payment_failed"
}
